 <div class="row">
        <div class="col-lg-9">
            <h1>578.Get Highest Answer Rate Question</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Get the highest answer rate question from a table <code>survey_log</code> with these columns: <b>uid</b>, <b>action</b>, <b>question_id</b>, <b>answer_id</b>, <b>q_num</b>, <b>timestamp</b>.</p>

<p>uid means user id; action has these kind of values: &quot;show&quot;, &quot;answer&quot;, &quot;skip&quot;; answer_id is not null when action column is &quot;answer&quot;, while is null for &quot;show&quot; and &quot;skip&quot;; q_num is the numeral order of the question in current session.</p>

<p>Write a sql query to identify the question which has the highest answer rate.</p>

<p><b>Example:</b></p>

<pre>
<b>Input:</b>
+------+-----------+--------------+------------+-----------+------------+
| uid  | action    | question_id  | answer_id  | q_num     | timestamp  |
+------+-----------+--------------+------------+-----------+------------+
| 5    | show      | 285          | null       | 1         | 123        |
| 5    | answer    | 285          | 124124     | 1         | 124        |
| 5    | show      | 369          | null       | 2         | 125        |
| 5    | skip      | 369          | null       | 2         | 126        |
+------+-----------+--------------+------------+-----------+------------+
<b>Output:</b>
+-------------+
| survey_log  |
+-------------+
|    285      |
+-------------+
<b>Explanation:</b>
question 285 has answer rate 1/1, while question 369 has 0/1 answer rate, so output 285.
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("survey_log", engine)

   uid  action  question_id  answer_id  q_num  timestamp
0    5    show          285        NaN      1        123
1    5  answer          285   124124.0      1        124
2    5    show          369        NaN      2        125
3    5    skip          369        NaN      2        126

In [3]:
query = '''
SELECT s.question_id 'survey_log'
FROM survey_log s
GROUP BY s.question_id
ORDER BY SUM(CASE WHEN s.action = 'answer' THEN 1 ELSE 0 END) / 
         SUM(CASE WHEN s.action = 'show' THEN 1 ELSE 0 END) DESC
LIMIT 1;
'''
pd.read_sql_query(query, engine)

   survey_log
0         285

## Note
# Time: O(n)
# Space: O(n)

#### 1. SUM( CASE WHEN [Condition] THEN 1 ELSE 0 END)
#### 2. COUNT(IF([Condition], [Value for True Case], null))